{"port":{"negr1":"The lappy is extremely cheap the processor is also a good one the only problem is linux which is of no use I didnt even opened linux and booted win 8 in my laptop the first timed i opened it all things work great i dont know why is the kenningston lock port really for they do not give any accessory for the lock port","negative":1},"guide":{"posr1":"Pros: Glossy surface 500 HDD awesome performance can play NFS old games smoothly( carbon,mw,ug) Cons: No bluetooth Fingerprint magnet no proper guide how to register 1 year additional warranty in Acer website ( tired writing e-mail to acer as well as flipkart) till date i dint get the additional warranty.. :(","positive":1},"budget":{"negr1":"Really amazing delivery in 2 days and good packing. Laptop: Nice look. Not supporting windows xp.. worth to buy this minimum budget.. Acer Laptop Bag : good Laptop bag and having comfortable compartments with kushan pad.","negative":1},"range":{"posr1":"A good laptop from Acer, though I found it difficult to use Linux, so I had to install XP on it....so the Linux OS with this Laptop and Price range is not satisfactory.....I mean the price is not justified.","positive":1},"rate":{"posr1":"Need to reduce the price of the product like 4 months before. I saw this product as a rate of 20299 in snapdeal website. so compare to snapdeal, flipkart has 5% high rate. also product should specifications differed from the snapdeal. correct specifications is needed to buy this product","positive":1},"performance":{"posr1":"Pros: Glossy surface 500 HDD awesome performance can play NFS old games smoothly( carbon,mw,ug) Cons: No bluetooth Fingerprint magnet no proper guide how to register 1 year additional warranty in Acer website ( tired writing e-mail to acer as well as flipkart) till date i dint get the additional warranty.. :(","positive":1},"card":{"posr1":"can i get this lappy on installments................................. and....................................................... which graphic card it possess....... can I install window on this lappy......................................................... is it dual core intel processor............???","posr2":"namaskar, i put that review after one week use of product first of all iwould like to tell about myself that i am not the master of computer sofware yet i know little bit about hardware i bought that machine only for saving time to go to net cafe for casual work machine did fine job so far video quality is better due 128 mb graphic card from similar price range laptops windows7 runs quite well","positive":2},"feature":{"negr1":"Good Laptop given the price..I'm very satisfied..The only bad feature is that the keyboard is very congested..kind of desktop keyboard fitted to a laptop..performance is good..Linux is not probably loading..Thanks","negative":1},"processor":{"posr1":"can i get this lappy on installments................................. and....................................................... which graphic card it possess....... can I install window on this lappy......................................................... is it dual core intel processor............???","positive":1},"games":{"posr1":"Pros: Glossy surface 500 HDD awesome performance can play NFS old games smoothly( carbon,mw,ug) Cons: No bluetooth Fingerprint magnet no proper guide how to register 1 year additional warranty in Acer website ( tired writing e-mail to acer as well as flipkart) till date i dint get the additional warranty.. :(","positive":1},"control":{"posr1":"Its really a very good product from the study and project point of view as it can take care of all one's need in very simple, stylish and unique way....Its really charming and under purchasing control of user.....really nice!!!!","positive":1},"Camera":{"posr1":"Overall good laptop. Service also good from acer support and Onsite warranty. Battery Back up is too good and nice Camera clarity. For Budget you can go for this laptop. Only Drawback is no Bluetooth.","positive":1},"speed":{"posr1":"i am using it since 1 year, haven't faced even a single problem. speed is also good. it doesn't get heated easily which is coolest thing i experienced. many times i use it continuously for 2 days but it never got slowdown of performance degradation till the day. and price is also very less.","posr2":"It is perfect buy for a person who just want to surf net,watch videos and sound quality is quite descent. Best buy for a student for s/w development purpose especially for this price. Total value for money. Windows 7 runs smoothly. The processing speed is good enough. It serves the need completely. Only drawback is that it does not come with Bluetooth connectivity. Its not meant for gaming though.","positive":2},"condition":{"posr1":"The product is good, received in perfect condition. dealing with flipkart online is better than anyother online websites.I love to buy from flipkart, Best regards, Thanks","negr1":"We have received the Laptop in fully packed condition. But the computer has following defects: 1. Linux installed is not opening at all. 2. DVD drive is very noisy and the laptop vibrates so much that it can't be used. Kindly refund send us a replacement or refund our payment imdtly. We bought thro Flipkart only because we shall save on time and efforts. Your imdt response will be appreciated.","negative":1,"positive":1},"keys":{"posr1":"This product has all the good things Speed Excellent Has all necessary ports such as HDMI The webcam is excellent Windows 8 is running very smoothly The bagpack is very cool The looks are the best Touch pad and keyboard are all very good and big keys The resolution is excellent HD I would say this is the best product for this range 4 words - Just go for it","positive":1},"bag":{"posr1":"Really amazing delivery in 2 days and good packing. Laptop: Nice look. Not supporting windows xp.. worth to buy this minimum budget.. Acer Laptop Bag : good Laptop bag and having comfortable compartments with kushan pad.","positive":1},"windows":{"posr1":"Thanks to flipkart for delivering me this product in just 10 days. rating: 2/10 U will never regret this product. I hope if we get genuine windows that would be much better. ram and hdd are quick responsive. System never lag. U can play Some HD games & Videos. Rating : 8/10","posr2":"Really amazing delivery in 2 days and good packing. Laptop: Nice look. Not supporting windows xp.. worth to buy this minimum budget.. Acer Laptop Bag : good Laptop bag and having comfortable compartments with kushan pad.","positive":2},"pixels":{"negr1":"A good product but not good service after buying. Faced a lot of OS related issues from the beginning. Now there are a lot of dead pixels cluttered over the screen but the service center people aren't ready to take in! :(","negative":1},"linux":{"negr1":"The lappy is extremely cheap the processor is also a good one the only problem is linux which is of no use I didnt even opened linux and booted win 8 in my laptop the first timed i opened it all things work great i dont know why is the kenningston lock port really for they do not give any accessory for the lock port","negative":1},"machine":{"negr1":"namaskar, i put that review after one week use of product first of all iwould like to tell about myself that i am not the master of computer sofware yet i know little bit about hardware i bought that machine only for saving time to go to net cafe for casual work machine did fine job so far video quality is better due 128 mb graphic card from similar price range laptops windows7 runs quite well","negative":1},"parches":{"negr1":"good laptop this prise to acer gateway flapakart sarves is varey varey good acer care is vareybad sarves next parches flakert 100% flapakart varevaregood acer campaney is good per not propeley caster car and notgood handel to workshop 2yer worante problem iapeter sarves isnotgood","negative":1},"ports":{"posr1":"This product has all the good things Speed Excellent Has all necessary ports such as HDMI The webcam is excellent Windows 8 is running very smoothly The bagpack is very cool The looks are the best Touch pad and keyboard are all very good and big keys The resolution is excellent HD I would say this is the best product for this range 4 words - Just go for it","positive":1},"webcam":{"posr1":"This product has all the good things Speed Excellent Has all necessary ports such as HDMI The webcam is excellent Windows 8 is running very smoothly The bagpack is very cool The looks are the best Touch pad and keyboard are all very good and big keys The resolution is excellent HD I would say this is the best product for this range 4 words - Just go for it","positive":1},"price":{"negr1":"i am using it since 1 year, haven't faced even a single problem. speed is also good. it doesn't get heated easily which is coolest thing i experienced. many times i use it continuously for 2 days but it never got slowdown of performance degradation till the day. and price is also very less.","negative":1},"window":{"negr1":"shreya u can install any window in this laptop ...i am using this laptop i think this is the best laptop in this price............i install the window 7 i this laptop this laptop is come with the driver dvd......and the backack oth this laptop is also very good quality","negative":1},"quality":{"posr1":"Excellent delivery, they are very good, received on expected date, item quality is good, i am satisfied with them!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","posr2":"shreya u can install any window in this laptop ...i am using this laptop i think this is the best laptop in this price............i install the window 7 i this laptop this laptop is come with the driver dvd......and the backack oth this laptop is also very good quality","positive":3},"configuration":{"negr1":"great laptop best configuration but keyboard is worst two days after buying buttons are removing one by one from keypad worst keypad ever i seen","negative":1}}
