{"drivers":{"posr1":"i purchased this product form wr retail it had dos os wanted to change to ubuntu but most hardware drivers are not available,then i installed win 7 still my web cam drivers are not working...i have to get win 8 another 7k extra..good delivery.. product is ok for the money.. pricing is less that is the only advantage...","positive":1},"package":{"posr1":"for its cost you cant have anything better than this.Its handy, nice looking, and a complete package.","positive":1},"heat":{"posr1":"Hence i purchased this product its cool and good, but bad thing is its get heat very fast so am unsatisfied with it :(","positive":1},"netbook":{"posr1":"the best configuration netbook at the price. the only issue is if you are not a windows fan and wants to get Linux or any other OS installed very difficult to use the touch pad with out physical buttons. also drivers not available for non windows OS","posr2":"This netbook is excellent at such lowest price. Delivery from WS Retail was fast and prompt. I have done sufficient survey before buying this item as well another few items Karbon S2 mobile and one cordless phone also before this buy through several online stores and I feel that Flipkart tops among all of them considering price and service.","positive":2},"Pad":{"negr1":"Good Product. Very Useful for Normal Use. Battery Life is Good. Compact Design. Touch Pad is not good.","negative":1},"battery":{"posr1":"Little notebook for little price but with full horsepower unlike atom powered notebooks. Small, light and even a mobile like charger but has a full sized six cell battery and celeron notebook processor. Backup is very good. lasts virtually one day in casual usage.","positive":1},"Screen":{"negr1":"Screen is very small then expected and it has to be 1 or 2 inch larger overall as otherwise this product looks unfit for normal use and looks only a display.","negative":1},"speed":{"posr1":"hi i brought this netbook nd within 2 months i sold this. Before this i was using sony vaio netbook and its now 2 nd haf year m still using this. Main problem with this is of keyboard. When u type in fast speed some letters are misprinted ..keyboard is really harshed.","positive":1},"OS":{"negr1":"the best configuration netbook at the price. the only issue is if you are not a windows fan and wants to get Linux or any other OS installed very difficult to use the touch pad with out physical buttons. also drivers not available for non windows OS","negr2":"really fast and efficient machine, small easy to carry and has good bat life, worth the investment. open OS helps in choose what are your applications.","negative":2},"buttons":{"negr1":"the best configuration netbook at the price. the only issue is if you are not a windows fan and wants to get Linux or any other OS installed very difficult to use the touch pad with out physical buttons. also drivers not available for non windows OS","negative":1},"price":{"posr1":"Making with best quality and strong feature with 10.1 screen felling like tablet with keyboard. Buy this with in best price at flipkart","negr1":"This netbook is excellent at such lowest price. Delivery from WS Retail was fast and prompt. I have done sufficient survey before buying this item as well another few items Karbon S2 mobile and one cordless phone also before this buy through several online stores and I feel that Flipkart tops among all of them considering price and service.","posr2":"Asus mini laptop is a good one for personal use who travel a lot and give many presentations. Its a good price which flipkart gives with a good quality too.","negr2":"Little notebook for little price but with full horsepower unlike atom powered notebooks. Small, light and even a mobile like charger but has a full sized six cell battery and celeron notebook processor. Backup is very good. lasts virtually one day in casual usage.","negative":2,"positive":2},"quality":{"posr1":"Asus mini laptop is a good one for personal use who travel a lot and give many presentations. Its a good price which flipkart gives with a good quality too.","positive":1},"heating":{"posr1":"i got this laptop from flipkart in 2 days, i installed windows 8 , after using its heating more, we cant to touch on body also that much heating happened in side of the body, we cant to use 1 more hrs continuously any way flipkart delivery is awsome.","positive":1},"configurations":{"posr1":"I have recently purchased this product and i feel its real worth for money. It also comes with good configurations.","positive":1},"horsepower":{"posr1":"Little notebook for little price but with full horsepower unlike atom powered notebooks. Small, light and even a mobile like charger but has a full sized six cell battery and celeron notebook processor. Backup is very good. lasts virtually one day in casual usage.","positive":1}}