{"body":{"posr1":"It feels very cheep & the plastic body is breaking easily.The Auto focus sucks.The zoom quality is very bad & there is not much control on your photos espessialy There is no ISO control. Dont buy this.. Cannon power shot 16mp camera is much better.","positive":1},"weight":{"negr1":"light weight, build with quality material & attractive colors, 20 mega pixel quality is same as the quality which will you get in a cell phone with 12mp, use only alkaline batteries for better battery life. for professional go to nikon SLR camera.","negative":1},"Quality":{"posr1":"Within 5K I got 20 Mega Pixel Camera Nikon Coolpix L28 with Excellent Photo Quality. I will suggest the buyers to buy this camera if their budget is 5K and want to have a Digital Camera with good quality.","positive":1},"zoom":{"posr1":"For this price range this is an pretty awesome camera. The video comes in 720hd, the video would have been of better quality if provided with 1080hd. The photo quality is superb. The optical and digital zoom is very good.","positive":1},"snap":{"negr1":"Image Quality is really bogus. flip kart delivery was good take 2-3 days to deliver this product. Picture taken time to shoot ,It take about 15 second to get ready to take next snap. package includes all items flipkart mentioned. Slower processing speed....takes upto 8-9 secs to finish recording a picture on 20mp mode.","negative":1},"pictures":{"posr1":"the delivery time was as usual good, well the camera is good for daylight photography & gives some descent pictures. During night time also pictures were good enough with flash. I tried shooting the videos during night time, but the video quality was not that good. Overall the camera is still the best in its range with its CCD Image Sensor.","posr2":"At 5k you will get the best pictures this 20.1 MP camera made me worth it buying..awesome quality pics and motion sensor is awesome and is best for night shoot my rating goes 4.5/5.You can buy it without any hesitation.","positive":6},"Flash":{"posr1":"Awesome Picture Quality, Very good Flash , Light Weight, Quick Image Processing, Shortcut Key for Video Recording, Optical Zoom is nice. Comes with Free 4GB SD card, Charger and Battery, Pouch. Its Worth buying and I am satisfied with this product.","positive":1},"performance":{"negr1":"I bought this camera (silver coloured) from flipkart. good service. Great picture quality .It is very cheap with 20mp. Good performance smart looking","negative":1},"battery":{"posr1":"Great Product, best quality for best price. Delivery was quick and even got additional rechargeable battery for free","posr2":"Excellent camera with 20 MP camera, Flipkart Packing is excellent and its delivered before time. With this Pack i received Timex watch freely. i received the package with warranty card, memory card, rechargeable battery and 2AA size battery, data cable travel charger pouch and camera everything. Excellent Product at excellent price","positive":2},"capacity":{"posr1":"I compltly satisfied with these product and it is with n number of features and its clarity and zoom was awesome..... i completly satisfied with this product and zooming capacity was good and it has number of features and with HD recording facility and i don't expected such a camera in my budget..","positive":1},"cam":{"posr1":"I just want to say, even my ace S5830i's 5MP cam is much-2-3 better than L-28's 20MP. Buying this cam is just waste of money, if you have extra money, then go for it. ;) I give it 1/10","posr2":"Thank you flipkart for your consistent and great service. It was like a jackpot! a real value-for-money deal. and you have delivered it exactly after 3 working days... My heartiest appreciation for the scheduled delivery, compact packaging and above all, quality of service. The cam is great too... :)","positive":2},"light":{"negr1":"Very very slow. It takes about 3-4 seconds to save the photo making it very inconvenient to take a second snap. Picture qualitiy not that great in low low light. Bottomline : A camera I would NOT recommend. I now use mine as a backup camera","negr2":"Photos are comparable as 20MP camera...... Photos in low light are bad....... Seeing the photos with the comparable with my 12 MP Mobile Camera..... Feels like waste my money........","negative":2},"control":{"posr1":"It feels very cheep & the plastic body is breaking easily.The Auto focus sucks.The zoom quality is very bad & there is not much control on your photos espessialy There is no ISO control. Dont buy this.. Cannon power shot 16mp camera is much better.","positive":1},"camera":{"posr1":"This is a good camera if you dont want to shell out too much money and are just looking to buy a camera for personal use. If you are looking for High quality pics then this product is not meant for you. But still having a camera for less than 5K is good as I just wanted it for personal use. Photo quality is decent and they give you rechargeable batteries which is good too.","negr1":"Good camera , affordable , simple , switch on and use value for money capture your moments. Flipkart amazing ..services... they should add more credit cards for offers and benefits .","posr2":"It feels very cheep & the plastic body is breaking easily.The Auto focus sucks.The zoom quality is very bad & there is not much control on your photos espessialy There is no ISO control. Dont buy this.. Cannon power shot 16mp camera is much better.","negr2":"Very very slow. It takes about 3-4 seconds to save the photo making it very inconvenient to take a second snap. Picture qualitiy not that great in low low light. Bottomline : A camera I would NOT recommend. I now use mine as a backup camera","negative":5,"positive":17},"batteries":{"posr1":"This is a good camera if you dont want to shell out too much money and are just looking to buy a camera for personal use. If you are looking for High quality pics then this product is not meant for you. But still having a camera for less than 5K is good as I just wanted it for personal use. Photo quality is decent and they give you rechargeable batteries which is good too.","posr2":"This camera is ok type of camera.But flipkart service is great. I got this camera within a week in a good condition.I got extra 2 rechargeable batteries with this kit and it has 2 year warranty. This product is made in china. So, I am not sure about it's durability.","positive":2},"memory":{"negr1":"not a good product to buy....very slow in every aspect...taking time to shoot another photo and taking to time to view the picture. i think very low internal memory. not recommeded at all......","negative":1},"picture":{"negr1":"It was purchased for my dad, easy to use and who gives a 20MP cam for under 5k Bucks, Superb delivery as usual by Flipkart. Just I felt processor is bit slow as you have to wait for 5-6 secs to take next picture.","negr2":"don't buy its not good to buy in-comparison to that if you buy sony pns that tis faar better then this.. this camera has got poor picture clarity. so if you are intrsted in camera go for samsung or Sony... nothing like just now i have purchased sony point and shoot its owsome camera... my final words dont buy this nikon L28","negative":2},"price":{"posr1":"It was nice experience to shop with flipkart and get a product in really good price! It was nice experience to shop with flipkart and get a product in really good price! It was nice experience to shop with flipkart and get a product in really good price!","negr1":"This is a camera with amazing quality and clarity. The reduced price makes it even sweeter. Serves your purpose and is a great buy. I got a 4gb and 8gb memory card along with the pouch absolutely free of cost which makes this camera a must buy.","posr2":"Excellent camera with 20 MP camera, Flipkart Packing is excellent and its delivered before time. With this Pack i received Timex watch freely. i received the package with warranty card, memory card, rechargeable battery and 2AA size battery, data cable travel charger pouch and camera everything. Excellent Product at excellent price","negr2":"i was surprised to find this product for such a low price... video clarity is just amazing ... thanks to flipkart... but automatic flash is a headache... it destroys the pic!","negative":3,"positive":4},"Processing":{"posr1":"Awesome Picture Quality, Very good Flash , Light Weight, Quick Image Processing, Shortcut Key for Video Recording, Optical Zoom is nice. Comes with Free 4GB SD card, Charger and Battery, Pouch. Its Worth buying and I am satisfied with this product.","negr1":"I ordered this on 16-06-2013.It taken one day time to transit from Bangalore to Hyderabad through FEDEX courier, I have waited 3 days but fedex not delivered, finally i went to fedex couriers and collected the pack, worst service. Nikon L28 taking 10 to 20 seconds time after taken the shot. Processing is very very slow. Picture quality is average. Don't buy this product.","negative":1,"positive":1},"quality":{"posr1":"photos quality are good and realizable. I did a lot market servey and found this is best camera in this range with this much good quality... go for it guys... Good delivery from flip kart..it took only 3 days to deliver","negr1":"light weight, build with quality material & attractive colors, 20 mega pixel quality is same as the quality which will you get in a cell phone with 12mp, use only alkaline batteries for better battery life. for professional go to nikon SLR camera.","posr2":"For this price range this is an pretty awesome camera. The video comes in 720hd, the video would have been of better quality if provided with 1080hd. The photo quality is superb. The optical and digital zoom is very good.","negr2":"I ordered this on 16-06-2013.It taken one day time to transit from Bangalore to Hyderabad through FEDEX courier, I have waited 3 days but fedex not delivered, finally i went to fedex couriers and collected the pack, worst service. Nikon L28 taking 10 to 20 seconds time after taken the shot. Processing is very very slow. Picture quality is average. Don't buy this product.","negative":4,"positive":8}}