{"speaker":{"posr1":"a device that's awesome with best speaker yes better than htc one with blackberry os 10.2.1 it's a beast no can take down capable of running more than 5 lakh android apps with a s pixel layout display and a battery that will blow your mind it's nothing like anything it's beyond everything","positive":1},"OS":{"posr1":"This phone is amazing, but again, BlackBerry has priced it a bit high, it should have been between 30-35K. The BB10 OS is brilliant and BlackBerry is looking to survive the last battle, now with Thorsten Heins out, BlackBerry can revive itself with John Chen.","posr2":"Its a great phone for both work and play. Amazing multitasking, can switch between apps without any lag or snaps...OS is really stable and intelligent. Definitely recommend. Display brightness could be improved - that's the only room for improvement","positive":2},"display":{"posr1":"a device that's awesome with best speaker yes better than htc one with blackberry os 10.2.1 it's a beast no can take down capable of running more than 5 lakh android apps with a s pixel layout display and a battery that will blow your mind it's nothing like anything it's beyond everything","positive":1},"lens":{"posr1":"The Phone is being built with enormous mind effort for the Consumers,,who really like fast and smooth multitasking and many more reasons... But only the lack point is the Camera lens which pics are brilliant with daylights but at something any mild dark area it lacks...But overall 5 Stars for the Phone..","positive":1},"pics":{"posr1":"The Phone is being built with enormous mind effort for the Consumers,,who really like fast and smooth multitasking and many more reasons... But only the lack point is the Camera lens which pics are brilliant with daylights but at something any mild dark area it lacks...But overall 5 Stars for the Phone..","positive":1},"battery":{"negr1":"this is the best phn by blackberry ever. this is most wonderfull ever smartphn with a such powerfull battery and again its from BB10.2 os...which is best ever... its best substitute for Apple","negative":1}}