{"thriller":{"posr1":"It came on 2nd day due to the best service provided by FLIPKART!! From the very first chapter it mesmerised me and is a real page turner. If u like crime and mystry in one...IT is a MUST BUY!! The best thriller by Sidney Sheldon Tilly Bagshawe..","posr2":"This is a good read. Why is it carrying the name Sidney Sheldon, when in no way its closer to his style. This is the first time I am reading Tilly bagshawe, luckily this happens to be a good thriller. The author lacks creativity that is evident, but some how manages to tell a good story.","positive":2},"suspense":{"posr1":"Unlike the novels of sheldon which had awesome suspense his legacy has not been carried forward properly by tilly billy. there is no suspense and one coul;d easily guess the story.","posr2":"its really a good book...book lovers will definitely love this book...there is a new suspense in almost every chapter...and to conclude its a typical sidney sheldon type--suspense murder romance sex betrayal ....go for it guys..worth purchasing... and thanks to flipkart i received this book within one day of ordering...","positive":2},"type":{"posr1":"its really a good book...book lovers will definitely love this book...there is a new suspense in almost every chapter...and to conclude its a typical sidney sheldon type--suspense murder romance sex betrayal ....go for it guys..worth purchasing... and thanks to flipkart i received this book within one day of ordering...","positive":1},"Mystery":{"posr1":"The story is predictable, and i could understand the entire \"Mystery\" in the first 50 pages itself, i was just dragging myself through the book hoping for a different ending but no luck! Don't buy the book cos you will be disappointed by the weak plot..I had a lot of expectations when i started off with the book but all in vain...","positive":1},"creativity":{"posr1":"This is a good read. Why is it carrying the name Sidney Sheldon, when in no way its closer to his style. This is the first time I am reading Tilly bagshawe, luckily this happens to be a good thriller. The author lacks creativity that is evident, but some how manages to tell a good story.","positive":1},"plot":{"posr1":"The book easily matches the quality of Sheldon's previous thrillers. The plot is good, the story is fast-paced and the overall effect is quite fascinating. there are few areas which may have been explained by the writer in a better manner. I would recommend every Sheldon lover to buy and read this one","negr1":"The story is predictable, and i could understand the entire \"Mystery\" in the first 50 pages itself, i was just dragging myself through the book hoping for a different ending but no luck! Don't buy the book cos you will be disappointed by the weak plot..I had a lot of expectations when i started off with the book but all in vain...","posr2":"This is an excellent book. As it is Sheldon is unpraisable, but this worthy of a book. excellent plot, contents and also the page quality & printing. The publishers no doubt done a great job. Thanks to them as well. So full marks from me.","negative":1,"positive":4}}