{"Quality":{"posr1":"Book was wonderful. Quality of this book is good and flipkart delivered well before their promised date. Go for it with out a second thought.","positive":1},"plot":{"posr1":"Nail biting excitement, gripping, excellent plot bordering along reality which is a welcome departure when compared to imaginary world type stories. Robert Langdon...how could you not love that man. Churchy affairs have always been messy. This story exploits that part of our lives well which we choose to ignore. A happy 10 on a scale of 5 !! Must read.","positive":1},"adventure":{"negr1":"A fast, thrilling, and nail biting adventure of Harvard professor Robert Langdon who, with the help of Sophie Nevue, manages to solve the mystery of the Holy Grail, and thus of Mary Magdalene, who was believed to be the spouse of Jesus Christ. After an extraordinary adventure in 'Angels and Demons', Langdon makes a perfect comeback, and deciphers the actual truth about Da Vinci's works.","negative":1},"thriller":{"posr1":"I don't think there is any equivalent work for this book. It is one of the best thriller and mystery book","posr2":"davinci code is one of my favorite thriller. the reality based narration makes this book as a mind blowing thriller when i started reading i cant put it down every chapter is filled with page turning suspense..","positive":3},"truth":{"negr1":"A fast, thrilling, and nail biting adventure of Harvard professor Robert Langdon who, with the help of Sophie Nevue, manages to solve the mystery of the Holy Grail, and thus of Mary Magdalene, who was believed to be the spouse of Jesus Christ. After an extraordinary adventure in 'Angels and Demons', Langdon makes a perfect comeback, and deciphers the actual truth about Da Vinci's works.","negative":1},"read":{"posr1":"Plot:A man in museum dies naked in Leonardo da vinci's Vitruvian Man's position.There is some message encrypted on his chest.Everything after this is related to the quest of finding Holy Grail.Will they be able to locate before its too late? Comment:A very good combination of detective,conspiracy theory and thriller plot. A good read.","positive":1},"perspective":{"posr1":"Dan Brown really became a master of thrillers after 'Da Vinci Code'.Hats off for his guts. This book might shock the conservative Christians.But keeping it aside it will entertain you thoroughly .It gives you different perspective or illusion .","positive":1},"end":{"posr1":"Absolutely brilliant.... Dan Brown is a perfectionist i would say.... The characters are created so well... So much attention is paid to each and every detail that a scene is created in front of your eyes... There is no loose end in the story.... Very delighted after reading such a freat book... Exceptional Stuff!!","positive":1},"ideas":{"negr1":"The Da Vinci Code by Dan Brown is a fast paced thriller where the main characters have to decipher clues in artwork, architecture and riddles to get to the bottom of a murder and save themselves. As a thriller, it is an O.K. pick, but not as good as Brown's Angels and Demons. The main characters discuss unsubstantiated religious ideas as if they are facts... For FLIPKARt I would give it A 10/10","negative":1},"IQ":{"posr1":"this book is a THRILLER and adventure, it has a high IQ but that's what makes it interesting. contains things u would have never thought of , A MUST READ!! also read other dan brown books.. totally worth it","positive":1},"enthralling":{"posr1":"i am completely flabbergasted by dis novel...best thriller..must read for everyone...the style..the story..the suspense..u will not b able to leave the book once u start it...a very enthralling read..!! and again hats off to flip kart for their amazing service...i got d book d next day...!!","positive":1},"history":{"negr1":"Though there are other books concerning religion, symbology, etc Dan Brown's masterpiece is unique; effortlessly blends fiction with symbology & real world history. It also introduces you to the world of cryptography - codes and puzzles! You need not have any knowledge of religion or history to dive into this one!! Whether you like fiction or thrillers, this book is a must read!","negative":1},"thrillers":{"posr1":"This is my first book of dan brown. But i instantly loved it. This book undoubtley one of the best thrillers. The way he narrates the story in this novel keeps you on the edge of seat right through the end U will be a fan of dan brown for sure if u read this book","positive":1},"secrets":{"negr1":"This is an excellent book. It unfolds the worst secrets of Church. The writing style is awesome. Even after being an English author almost no slang or bad words are used. A must buy for all book lovers","negative":1},"combination":{"posr1":"Plot:A man in museum dies naked in Leonardo da vinci's Vitruvian Man's position.There is some message encrypted on his chest.Everything after this is related to the quest of finding Holy Grail.Will they be able to locate before its too late? Comment:A very good combination of detective,conspiracy theory and thriller plot. A good read.","posr2":"just an awesome book.. i don't just recommend it but it would be sin to to read this one. an awesome combination of science,religion and of course thrill..","positive":2},"characters":{"posr1":"The Da Vinci Code by Dan Brown is a fast paced thriller where the main characters have to decipher clues in artwork, architecture and riddles to get to the bottom of a murder and save themselves. As a thriller, it is an O.K. pick, but not as good as Brown's Angels and Demons. The main characters discuss unsubstantiated religious ideas as if they are facts... For FLIPKARt I would give it A 10/10","positive":1}}