{"pace":{"posr1":"The books starts with the usual Dan Brown pace and grip. The build-up and intrigue are exactly what you expect. Towards the end, however, you realize that the big reveal is just a fizzle.","positive":1},"Caracter":{"negr1":"Its the worst Dan Brown Book till date. It seemed like the story is jus plugged a lil here n there in a big fat history book. too much info and very less story. Only Caracter to watch out for is the antagonist.","negative":1},"plot":{"posr1":"I feel this is also a good one from Mr. Brown, As it is from the same Author the way of writing might be kind of same but as per the Topic he selected, he did very good research and povide amazing facts with nice plot.","negr1":"After a good number of captivating series with Prof Langdon, Dan lets readers down with a very lengthy and thin plot, a story woven around America's founder architects. A story not much captivating but a pass off unless you are a die hard fan of Dan Brown. Could have made it more interesting with a better suspense and pace of the story","negr2":"This book was nice. But compared to other Dan Brown books it was not so okay. The plot was not so fast paced or surprising as his other books like Angels and Demons. The villain only kept the book alive. But all in all it was a good read.","negative":2,"positive":1},"thriller":{"posr1":"The lost symbol is an awesome thriller in the Robert langdon series .. Made me read day and night .. The best book in the Robert Langdon series.. Waiting eagerly now for the next book in this series ... Dan brown is an excellent author ..","posr2":"The Lost Symbol... we are lost in our own world but the words of Dan ask us to come back and see the real world:) The Story as usual a great thriller starting from the strange mirage of a symbol lost and the person who is trying to get that making our hero to go everywhere where he actually dont want to go;) Hope you will also like a book like this:)","positive":2},"read":{"posr1":"A page turner, but did not have the kick that other novels from Dan Brown have. As compared to other Langdon mysteries, this one doesn't entice the reader as the story unfolds. However, the novel is a good read. Dan Brown's forte :).","posr2":"nice read twist and turn in every chapter.................................... one should read if you are a Dan Brown fan","positive":3},"information":{"negr1":"As usual of Dan brown, the book talks about another secret society.but on this book the plot so predictable. the story is simple but the way its displayed is too long and exhausting. Too much information was on display so hard to keep in mind.Finally it ends with good message.I ENJOYED READING.A great book every one must reed.","negative":1},"art":{"posr1":"nice art ,good and very simple .hard to believe the facts he points out.stories of masons and American history as a beginner in literature I'm very impressed..........","positive":1},"potential":{"posr1":"the exciting journey and a great unique story telling technique. that was a.... WOW at the end, a simple and splendid way to tell the humanity its true potential in a non controversial way. thank you flipkart i enjoyed the book a lot.","positive":1},"suspense":{"posr1":"After a good number of captivating series with Prof Langdon, Dan lets readers down with a very lengthy and thin plot, a story woven around America's founder architects. A story not much captivating but a pass off unless you are a die hard fan of Dan Brown. Could have made it more interesting with a better suspense and pace of the story","positive":1},"combination":{"posr1":"Just superb!!!! Another Dan Brown hit!!! Simply fantastic read!!! A beautiful combination of mystry, religion, science and spirituality........... it will simply make u bite ur own nails.............!!!!!","positive":1},"paced":{"posr1":"Awesome and thrilling experience taking us through the unknown past. Once you start reading the book u will not be stryaed by any emotion that comes in the. A very quick paced a self revealing work by DAN Brown.","positive":1},"characters":{"negr1":"Super cool characters, awesome locations, thrilling, spine chilling, adventure packed. Robert lived up to his expectations.","negative":1}}