{"photographs":{"posr1":"I have been using this camera without any issues since last one year. It has infact been a pleasure using this product. I have used this camera on holidays, parties, with family and I have got exceptionally good photographs. This camera is user friendly and produces good quality pictures.","positive":1},"settings":{"posr1":"Quick delivery from Flipkart. This one of the best entry level DSLRs. Its easy to use, beginners can just use auto mode and later on choose the professional settings. Swivel screen is great for shooting from different angles. Got a bag and 2 memory cards bundled. Was a good deal.","positive":1},"pictures":{"posr1":"I have been using this camera without any issues since last one year. It has infact been a pleasure using this product. I have used this camera on holidays, parties, with family and I have got exceptionally good photographs. This camera is user friendly and produces good quality pictures.","posr2":"Once again, I could afford a camera as cool as this. Thanks to FlipKart's offer and the no extra charges emi scheme. I ordered the camera at around midnight and had it at my door in a couple of days. The camera is an excellent one and it has some awesome pictures that make clicking easy and enjoyable","positive":2},"card":{"posr1":"canon 600d is best dslr for learning photography, its best cam in mid range segment with compare with other dslr, and hats off to flipkart i got delivery within just 48 hours with great packing lens cleaner, tripod, 32gb memory card is good but i'm disappoint with carry bag, i think i've to buy new bag to increase camera life, satisfied with service.","positive":1},"cam":{"posr1":"canon 600d is best dslr for learning photography, its best cam in mid range segment with compare with other dslr, and hats off to flipkart i got delivery within just 48 hours with great packing lens cleaner, tripod, 32gb memory card is good but i'm disappoint with carry bag, i think i've to buy new bag to increase camera life, satisfied with service.","positive":1},"cameras":{"posr1":"Canon cameras are excellent, once can click very nice clicks .One should know how to use it.Even my brother is using same.Excellent product and quality.","negr1":"This Camera which comes from a reputed brand , it costs many bucks to people pocket. As there are some cool phones % cameras launched by Panasonic in recent days like T11 , P51 and LUmix . I'm opting for them as they comes with cool offers too.","posr2":"i am using this camera from last 6 months...on basis of i can say that is the best camera at price..excellent ergonomic.........great image quality......and better videos quality than many professional video cameras even with kit lens.......","negative":1,"positive":2},"screen":{"posr1":"Quick delivery from Flipkart. This one of the best entry level DSLRs. Its easy to use, beginners can just use auto mode and later on choose the professional settings. Swivel screen is great for shooting from different angles. Got a bag and 2 memory cards bundled. Was a good deal.","negr1":"it is the man behind the machine who matters but it doesnt hurt to have a capable machine. The flip screen is certainly a big plus. The canon vs nikon debate is everlasting but just go for whatever you decide and if this is your choice then you wont regret it one bit.","negative":1,"positive":1},"bag":{"posr1":"canon 600d is best dslr for learning photography, its best cam in mid range segment with compare with other dslr, and hats off to flipkart i got delivery within just 48 hours with great packing lens cleaner, tripod, 32gb memory card is good but i'm disappoint with carry bag, i think i've to buy new bag to increase camera life, satisfied with service.","positive":1},"lens":{"posr1":"Very nice camera for beginners till one becomes expert in using it. However its better if we buy along with any other lens other than the kit lens to explore more and gain expertise in using the DSLR.","posr2":"This an awesome camera and having a great value for money. Pair it with good quality lens and here you go..great professional shots.","positive":3},"price":{"posr1":"excellent camera with awsome features, proper price, awsome speed delivery by flipkart. Used this and i'll say i'm totally satisfied","negr1":"This camera is just awesome. Has everything that a DSLR camera needs. If you are not a pro, this is the best you can get < 40K. And don't compare it with Nikon D5100 (almost same price), both are awesome. Neither will disappoint you.","posr2":"I am planning to buy this camera since 1 month and the price is too high compared to amazon.in . But I am very loyal to flipkart. And I buy only on flipkart, because service is too good. But the price makes me a little unfaithful. It's tempting to buy the same product for cheaper price!!! Hope the price reduces..Why does the price fluctuate?","negr2":"it is so nice working good camera.i found it in your site very lowest price compare with another stores.this product also looking very good.i found it in your site very lowest price compare with another stores.this product also looking very good","negative":2,"positive":2},"navigation":{"posr1":"smooth animation capabilities for amazing visuals and excellent navigation. smooth animation capabilities for amazing visuals and excellent navigation.","positive":1},"cleaner":{"posr1":"canon 600d is best dslr for learning photography, its best cam in mid range segment with compare with other dslr, and hats off to flipkart i got delivery within just 48 hours with great packing lens cleaner, tripod, 32gb memory card is good but i'm disappoint with carry bag, i think i've to buy new bag to increase camera life, satisfied with service.","positive":1},"quality":{"posr1":"d 3200 has a slightly better image quality but 600d has much better video quality and even the MACRO mode. go for 600d because: 1. the macro mode 2. awesome video quality 3. extremely helpfu flipout screen","posr2":"This camera is simply the best for beginners. The manual itself will guide you through the basics of photography.One thing that i like is the build quality ans the flip screen. Build quality is far better than 1100D and other nikon products in the range. I even drenched the camera in the rains still no problems :-). Go for this if you like to record video as well. 4/5 for this incredble camera","positive":5},"capabilities":{"posr1":"smooth animation capabilities for amazing visuals and excellent navigation. smooth animation capabilities for amazing visuals and excellent navigation.","positive":1},"output":{"posr1":"Flipkart delivered this camera within one day with an excellent packing. It is a very good camera for beginners, very easy to handle the settings and functionalities and it has premium features too. Very good output. Thanks to Flipkart.com. I love to shop on flipkart.","positive":1}}