{"Camera":{"posr1":"This is my 1st D-SLR Camera. I'm really impressed with it and would recommend to all of those who are going to buy their 1st D-SLR Camera. It has all the features that one would expect from a good camera and will definitely please those who are looking for a good D-SLR under Rs.30,000. A must buy I'd say... Cheers","positive":1},"Settings":{"negr1":"Best Camera to start learning on how to use a DSLR , Best Photo / Video Quality after using only Point & Shoot for long years. Many other Settings to explore . NB : Pls Guide on a online Link to learn more about DSLR ...","negative":1},"pictures":{"posr1":"Amazing for beginners,specially teen who wish to upload good pictures on social networking sites :) Heads-up to NIKON for this amazing camera. Guide mode is not required much really but helpful is under the guidance of a PRO photographer. Auto focus isn't much help either but we all know what is landscape and portraits e.t.c !","posr2":"This was my first DLSR. Needless to say, the Flipkart delivery was prompt with all documentation and good packaging. The D3100 is better buy than its Canon competition. The quality and feel of the product is great. Good for new DSLR users. With a little bit of understanding you can start shooting great pictures in no time. I will recommend this product to all.","positive":2},"lens":{"posr1":"Good DSLR to start with. 18-55 lens is good, you can get moderate BOKEH with this lens. Better go for a lens with lesser stops or f-number . Awesome camera though. Build quality is way better than the plastic body of Cannon 1100D from the same range. For better reviews ask Jared Polin on youtube. He is a pro and will explain this camera better.","negr1":"Got the camera from Flipkart within 3 days and at amazing price of 21.5K I feel it is the best entry level DSLR that you can purchase to get started. The lens is elementary and useful for everyday shots. Lens is a critical requirement if you want to do some advance photo techniques. Overall pretty good for the price!","posr2":"This is an awesome product. The kit lens is great and will give you good pictures. If you wish to learn or pursue photography this could be exactly what you need to step into the world of photography.","negr2":"Its a great camera especially for someone who has just started using DSLRs. The range is great and you can use your imagination to get whatever results you want. The only thing which is lacking is a good zoom, which I learnt is the same with all DSLRs. You need to buy a separate lens for that. Start using one and you will know!","negative":3,"positive":2},"photo":{"posr1":"Got the camera from Flipkart within 3 days and at amazing price of 21.5K I feel it is the best entry level DSLR that you can purchase to get started. The lens is elementary and useful for everyday shots. Lens is a critical requirement if you want to do some advance photo techniques. Overall pretty good for the price!","positive":1},"mode":{"posr1":"This is really an awesome camera i bought it two months ago and using it at the fullest. This DSLR is really good for for the beginners specially the guide mode is just awesome . Image quality no doubt is very good . Ergonomics is simply very good when compared to canon 1100d . This camera is really a boon to photographers who want to be out of the point and shoot world .","posr2":"Amazing for beginners,specially teen who wish to upload good pictures on social networking sites :) Heads-up to NIKON for this amazing camera. Guide mode is not required much really but helpful is under the guidance of a PRO photographer. Auto focus isn't much help either but we all know what is landscape and portraits e.t.c !","positive":2},"price":{"posr1":"i had experience with the model and i am satisfied with result where as i required more models also if you give me better price.","posr2":"Thanks to flipkart. I got this product for the best price 19600 after applying HSBC cashback offer. I just took this camera for capturing photos of indoor events and few outdoor occasions. After taking some pictures I am confident that it will serve my purpose.","positive":4},"battery":{"posr1":"Good product for beginners, with large image sensor!. The white spot on lens not affected picture quality. Everyone Should have to purchase an extra battery because you will need those later..! Enough said.!","positive":1},"quality":{"posr1":"I bought this camera almost a year back not from flipkart but i bought my Tamron 70-300 mm lens from flipkart, its an amzing camera in its price there is no alternative Of D3100, very good in HD video, Easy to Use and excellent indoor & Outdoor picture quality,","posr2":"Good DSLR to start with. 18-55 lens is good, you can get moderate BOKEH with this lens. Better go for a lens with lesser stops or f-number . Awesome camera though. Build quality is way better than the plastic body of Cannon 1100D from the same range. For better reviews ask Jared Polin on youtube. He is a pro and will explain this camera better.","positive":4},"flexibility":{"posr1":"Best for beginners. Plenty of features to experiment with.. offers great flexibility by inclusion of vibration resistant nikor kit lens.. Also doubles as a \"point and shoot\" camera for those who are lazy enough to experiment things.. Best buy..","positive":1}}