{"Look":{"posr1":"Product was Delivered within 3 days as told.freebie also worthy,really great Offer.but plastic Look that is only thing we need to worry.but speed and all is good,packaging is perfect for safety of the Goods and we can effort that much amount on this product","positive":1},"cover":{"posr1":"Good laptop, good configuration. Got around 2:30 hours of battery on my first use. comes with Ubuntu 12.04, which I am new to but quite user friendly and comes with most of the useful applications installed. Lots of plastic used but real good finish, best is the strips on the top cover with a rubbery feel for super grip. Really happy with the product so far :-)","posr2":"I purchased this laptop about 2 weeks ago , I got the delivery within 2days. It is a good laptop at this price. Screen is awesome,speed is good. only thing I didn't like is that its front body. It looks like a plastic cover that doesn't look good. Apart from that every is good..","positive":2},"performance":{"posr1":"Vostro series laptops can't be purchased in your local big electronics shops . They said vostro can be purchased only in online. This laptop performance is nice. Battery have a long backup more than 2.30 hrs. If it is ok to work with ubuntu os this is very best laptop to buy at reasonable price from flipkart.","posr2":"Excellent delivery by flipkart as usual..great product and amazing performance in this budget.happy with the overall response","positive":2},"battery":{"posr1":"This product has ubuntu os which is no familiar.You have not provided ubunt os In future supply dvd/cd of os. over all good product, speedy working. I have installed windows 8 it is working good battery is quite good and last up to 3 to 4 hours. when use continusly. The colour and appearance is to good. i like it. and i have recommended this to my friends.","positive":1},"features":{"posr1":"It is a very nice product from dell . It's features are very unique but PANASONIC has launched a shubhagaman campaign in which many of offers are given !!!!!","positive":1},"driver":{"posr1":"really this is good product i face problem with webcam but after call to dell customer care the guide me and my problem is solved only one request to dell that put updated driver for all so cust can use this easily","positive":1},"Performance":{"posr1":"Its a very good configuration by Dell and we are already using this model in our office for application development. Performance wise its good, look and design of laptop may be not as good as other Dell models, but its value for money.","positive":1},"backup":{"posr1":"I Am using DELL VOSTRO 5220 since last year.I think this laptop is best in this prise compare as other company laptop. Battery backup is awesome-4 to 5 hr. overall excellent product.","positive":1},"look":{"posr1":"good and better perfomance in dell laptop , speed verry fast and good look. Be yourself, be informative Let your personality shine through, but it's equally important to provide facts to back up your opinion.","positive":1},"os":{"negr1":"I am very happy about your delivery timing, and the quality of the product is good, but why dell is providing ubuntu os in laptop, this os is very bad.","negative":1},"Body":{"posr1":"Its worth buying for Student . Tech configuration is very good for beginner who need laptop for study not for games. Body build quality need to improve.","positive":1},"speaker":{"posr1":"I have bought this product one month ago. In very first day it got hanged twice, but after that it was working fine. Then I tried to install Windows-7 but I face some problem with compatibility issue. Last day I was watching movie in full volume, then after five minutes the right side speaker goes off. Only left speaker is working with a bad quality sound.","positive":1},"price":{"posr1":"With the reliability of DELL and relatively cheaper price in this config., its a value for money product. Pros: value for money. reliable, rugged Drawback: No driver DVD supplied with the product. You need to dig 'em out from the internet.","negr1":"First want to say thanku to flipkart that they are providing low price than market and with good and genuine product......The product is awesome if we know about the OS.... I suggested many of my friends to purchase from flipkart...","posr2":"This is the first big thing I purchased from Flipkart. I received the product within 3 days from order placed. The packaging is extremely good. About the laptop. Its working as expected. U can not expect something extraordinary from a laptop in this budget point of price. Overall its very good for daily usage. Thanks to flipkart for the best price and the best deal which they are offering to their customers.","negr2":"very very nice laptop ,cheap price nice to use .only one thing touch scroll is very poor to use...... battery stands for 2hrs to 3hrs...nice product for this prices","negative":2,"positive":8},"ram":{"posr1":"excellent laptop. display is good and works so smooth and silent. very useful and convenient ram for multitasking","positive":1},"sound":{"negr1":"I have bought this product one month ago. In very first day it got hanged twice, but after that it was working fine. Then I tried to install Windows-7 but I face some problem with compatibility issue. Last day I was watching movie in full volume, then after five minutes the right side speaker goes off. Only left speaker is working with a bad quality sound.","negative":1},"quality":{"posr1":"Pros: 1) Economical & Reasonable price 2) Good configuration: i3 2.4Ghz, 4GB ram, 15.6' etc. Cons: 1) The build quality is not as good as i5 laptops. But it's much light weight 2) you'll need to installed windows separately (it's an advantage though) 3) No USB 3.0","posr2":"I am very happy about your delivery timing, and the quality of the product is good, but why dell is providing ubuntu os in laptop, this os is very bad.","positive":2},"configuration":{"posr1":"Its a very good configuration by Dell and we are already using this model in our office for application development. Performance wise its good, look and design of laptop may be not as good as other Dell models, but its value for money.","posr2":"Its worth buying for Student . Tech configuration is very good for beginner who need laptop for study not for games. Body build quality need to improve.","positive":3}}