{"speed":{"posr1":"It's a nice product in this price range. Display, speed and battery are good. only problem is with sound , it's a bit low.","positive":1},"Display":{"posr1":"It's a nice product in this price range. Display, speed and battery are good. only problem is with sound , it's a bit low.","positive":1},"heavy":{"negr1":"Pro: - Good Camera - Good for gaming - Fast processor - Good display Con: - Feels a little heavy - Average speaker sound quality","negative":1},"memory":{"posr1":"this tab is very good comparing to its competitors.its display is very good.its battery backup is good.back camera resolution is very good.it is running smoothly without any hanging.the internal memory is low.but you can manage this with agood quality micro sd card.i am living in a small out reach town of tamil nadu but flipkart delivered this product in three days.price is also cheap comparing to others.packing of the product is very good [WS RETAIL]","positive":1},"price":{"posr1":"Just bought the asus fonepad 7 a week ago. Awesome device at a great price. No complaints. Surprisingly the tablet nicely fits into my pocket. Great job asus.","positive":1},"covers":{"negr1":"Just awesome in everything but there is no exact flip covers for Asus. Otherwise it good choice. :-)","negative":1},"performance":{"negr1":"Got it a week back.. flawless performance be it touch, camera, response time etc.. it is worth every penny you pay.. and Flipkart delivery is awesome got it 3 days before expected delivery. Although packaging is what vendor needs to be worked on.","negative":1},"card":{"negr1":"this tab is very good comparing to its competitors.its display is very good.its battery backup is good.back camera resolution is very good.it is running smoothly without any hanging.the internal memory is low.but you can manage this with agood quality micro sd card. i am living in a small out reach town of tamil nadu but flipkart delivered this product in three days.price is also cheap comparing to others.packing of the product is very good [WS RETAIL]","negative":1},"battery":{"posr1":"It's a nice product in this price range. Display, speed and battery are good. only problem is with sound , it's a bit low.","positive":1},"processor":{"posr1":"Everything is good about this fonepad 7 tab.. Intel processor is really smooth butter. ONLY genuine issue that Asus can solve is the resolution / brightness.. that's very dull.","positive":1}}