{"amalgamation":{"negr1":"I picked this book up having read Chanakya's Chant and being impressed by the author. This book was promised to be another mythological - modern time amalgamation thriller. However, this one turned out to be a let down. The suspense, the pace and the storyline were of a much lower quality than Mr. Sanghi's other book. Give this a miss and read Chanakya's Chant again!","negative":1},"balance":{"posr1":"The kind of research work went into this work is amazing. Its striking a perfect balance between facts & fiction. The narrative style is second to none. Ashwin Sanghi Rocks!!! Ofcourse FLIPKART is always the best....be it pricing, be it packing or the delivery of the product.","positive":1},"thriller":{"posr1":"Ashwin Sanghi is the Dan Brown of India.. Its a gripping thriller, with a lot of religious references and conspiracy theories. A fun read","positive":1},"Climax":{"negr1":"Too much of violence. You don't understand much until you have finished 50 percent of the book. Everything make sense towards the end. Climax is quite disappointing","negative":1},"language":{"posr1":"A good book with nice language and text but.... Felt like reading Dan brown books...the author should definitely have his own way of writing... I guess Tats Wat s missing in tis book... I hope the next book ll be okay upto my expectation...","negr1":"The author has created a myth out of thin air. There are many discrepancies and distortions in the narration. Again the language is very ordinary without any literary attributes. I will not recommend this book to amyone.","negative":1,"positive":1},"character":{"posr1":"Ashwin Sanghi has tried to add too much content and story line to a small book resulting in too much and unwarranted twists and suspense. Too many characters make it difficult in the beginning made it difficult to identify the lead character in the story. This book is better than Krishna Key but is not as well thought out as the Chanakya's Chant","positive":1},"plot":{"posr1":"A good read. In the line of Da vinci code and Angels & demons. Though, I know the story is truly fictional, I felt like believing the whole plot. Really enjoyable to Indians, and those who know Hinduism and India.","positive":1},"style":{"posr1":"The kind of research work went into this work is amazing. Its striking a perfect balance between facts & fiction. The narrative style is second to none. Ashwin Sanghi Rocks!!! Ofcourse FLIPKART is always the best....be it pricing, be it packing or the delivery of the product.","positive":1},"read":{"posr1":"This is surely one of the best by Ashwin. The language and the depiction may not be mindblowing but it is definitely a good read","posr2":"the lost days of christ. Christ survived crucification and many myths all interwoven ambitiously. It is a good read if you can keep track of the skeletal story and look past the over feed of charecters and information","positive":5},"fiction":{"posr1":"I enjoyed reading every page of this superbly written factual fiction in one sitting...a very original idea to peep into the history of world religions to gain a meaningful perspective of their basic fabric...Ashwin Sanghi has indeed emerged as the King of Historical Fiction...","posr2":"great fiction yet filled with information about the religions.. recommended!! the theological thriller is nicely studied and reference list is made by the author for your reference. good source of info.","positive":2}}