{"writings":{"negr1":"This is one of the easiest to digest philosophical writings I have read in recent times. What an inspiring fable! The fable-like approach makes it easy to comprehend. It should be made a must-read for young school children. Will help many in achieving their dreams.","negative":1},"dreams":{"posr1":"This book talks about dreams, aspirations, sacrifices, destiny & the beauty of the unknown in a magical way, Paulo Cohelo is the creator of a world which is both magical & realistic,he builds a bridge between the real world and the paradoxical dreams that sometimes we aspire. This book will be a masterpiece for years and years to come.","negr1":"This is the only book i read of Paul Coelho, but i must say ...its a book every person should read it....an awesome book which inspires you to fulfill your dreams....it ignites your sleeping dreams .....it makes u understand how to chase your dreams and fulfill them.","negative":1,"positive":1},"inspiration":{"posr1":"fiction and philosophy, great inspiration in simple words. what a combination it is. I think its a must read book for a reader.. I will read his other books too, for sure. it brings outs the every positive thing you have and to think out on every possible way. it surely helps you to think on the other side of a obstacle, the positive one..","positive":1},"perspective":{"posr1":"The story just keeps you glued to the book and it is a must read for one and all. I t gave me a new perspective of life and is definitely life reforming (as said by many).I t has a easy language and transports one into another world.It is very meaningful and opens doors to a new life.","positive":1},"philosophy":{"posr1":"Those who like fiction and imagination, this is a must read for you! The book is very easy and simple to read. The philosophy and some wisely written things are so amazing. I like a few quotations mentioned in the book. So deep and important to understand life. Especially the end of book is amazing!!!! Thumbs up :)","negr1":"Alchemist is the most over rated book I have ever read. Lured into it by its popularity which is just a thick mirror which covers basically very little material inside with no concrete story line and very weird philosophy this book fails to knock any of my senses. Better spend your hard earned money on some other author than paulo coehlo. Best wishes if you still read this!","negative":1,"positive":1},"price":{"posr1":"this site is simply awesome than any other site and has the best price of all..................... the books in it are really worthy and you are having excellent consultancy with your customers thats why FLIPKART stays talll among all","posr2":"It's an amazing book. Everyone should must read it The story of Santiago is worth reading and everyone who are deaming to achieve something in life must read this. Flipkart is good place to get it. Good price and Quick delivery.","positive":3},"narration":{"posr1":"This books takes you through a mysterious journey of understanding the hidden treasure in every body's life. The experience can only be felt.This is one of the finest modern philosophical books in the rank of Jonathan Livinston Seagull by Richard Bach.The narration of the story is lucid and simple in language but a profound truth underlying every sentence. Every one who wants to understand the meaning of life must possess this book.","positive":1},"quality":{"posr1":"got the book in excellent condition with a bookmark in less than 4 days!!!!!!!! I have not started reading this book but I have heard that the book is pretty awesome and it motivates u greatly........buy this book if u want to know your true purpose in life.......and the packing quality was amazing.....thanks flipkart!!!!","negr1":"Definitely its a good inspirational story for our life. But paper quality is poor for the book i got. Except that everything is good. But if you only want to read the story and dont want the paper to be of superior quality, then its worth to buy.","negative":1,"positive":1},"language":{"posr1":"We travel everywhere to seek our treasures of happiness and peace, but it is always there within us. The language is lucid and simple, even a layman can thoroughly enjoy reading this book without flipping a dictionary.","negr1":"A very inspiring story. Actually I bought the book after reading it twice.. so easy to understand.. written in simple language. An amazing book by Paulo Coelho.. Each and every sentence make us thinking..","posr2":"The story just keeps you glued to the book and it is a must read for one and all. I t gave me a new perspective of life and is definitely life reforming (as said by many).I t has a easy language and transports one into another world.It is very meaningful and opens doors to a new life.","negr2":"Whenever I read a book, I experiment the direct impacts on life. The impact of communicating with the unsaid language has helped me achieve confidence and have some faith. I am an atheist, but I feel that the omens are possible. I have seen all of it happening and I finally can understand the soul of the world. Thank you Coelho.","negative":2,"positive":2},"prose":{"posr1":"The story of the shepherds journey packs in lots of nuggets of wisdom. The simple prose is easy for readers of all age groups to follow. Paulo Coelho's masterpiece will be read by generations to come.","positive":1},"inspirational":{"posr1":"really worth reading many time .. flipkart delivered it to me really quick ... its very inspirational and the book really teaches you how your choices affects your life and how to make those choices , right blend of philosophy, instincts , courage one should have in leading life in a way this book serves you as an eye opener and a guide for people at cross roads... beautiful book :)","positive":1},"instagram":{"posr1":"an amalgam of inconclusive aesop fables and whimsical plots. i dont get the hype around the author whose books are merely old wine in a new bottle. screw the chronology,introduce a third world set-up, conjure a mental instagram of supposed fairy kingdoms and BAM! you got yourself a glossy 200 paged paulo coulho novel. the whole journey was obvious and rugged like the paper quality.","positive":1},"understanding":{"posr1":"A beautiful book which will transform the way you perceive things.. It will help you realise that everything boils down to some basic facts,which are lucidly explained in the book..After reading it I have better understanding with life and how things actually work and that everything has a purpose and that all are but one! A masterpiece!","positive":1},"insight":{"posr1":"A very good book with great insight on what life is all about and how to make the most of it. This is definetly a book you should read before you die. The story telling is spellbinding and leaves one with an insight into the life of generations of human race, which were in search for something more.","positive":1},"motivator":{"posr1":"My favorite book. I am yet to read a book as powerful as this one. A human tale that is inspiring, positive and supernaturally strong motivator. A Shepherd travels to a destination of his dreams while unravelling the super strength of mind. A must have in the collection.","posr2":"The Alchemist by Paulo Coelho is a book which tells how a boy follows his heart to reach his destiny and the difficulties he faces while reaching his destiny. So i feel this book is a great motivator for all those who want fulfill their destinies or dreams.","positive":2},"character":{"posr1":"anather excellrnt tale by coelho.buy it because it will hook you till the end.its never predictable it also have a kind of message that he give to his readers.a mix of fantasy too.just go for it.its a decent read.the character is also very honest innocent","positive":1},"words":{"posr1":"It's a really nice book by this Brazilian author. It's the first book of him I've read an I really loved this book. The way the story moves and the suspense unfolds and how the shepherd gains the knowledge about the SOUL OF THE GOD. \"Superb Work\" in shortest possible words.","negr1":"fiction and philosophy, great inspiration in simple words. what a combination it is. I think its a must read book for a reader.. I will read his other books too, for sure. it brings outs the every positive thing you have and to think out on every possible way. it surely helps you to think on the other side of a obstacle, the positive one..","negative":1,"positive":1},"read":{"posr1":"The message from the book is very clear. Dare to run after your dreams and they will come true no matter how difficult or impossible they may seem. A good short read for a quick dose of motivation.","negr1":"The delivery was as usual - \"Awesome\". Got it within two days. This book is kindof an example of good things come in small packages. The read is small but the meaning could take you on a whole different journey. A must read from my side. Thank you for reading and thank you flipkart","posr2":"A very simple tale, outside of the world of glamor and magic.... The tale follows a simple shepherd boy, intending to follow his dreams. A thorough read of this book will get you rethinking about several things in your own life !","negative":1,"positive":4},"spirituality":{"negr1":"fiction readers who want to start reading philosophical books ...THE ALCHEMIST could be a good choice but for those only into philosophy /slight spirituality , might not be an extremly good book .... however you can give it a try ...you might like it :) :)","negative":1},"strength":{"posr1":"My favorite book. I am yet to read a book as powerful as this one. A human tale that is inspiring, positive and supernaturally strong motivator. A Shepherd travels to a destination of his dreams while unravelling the super strength of mind. A must have in the collection.","positive":1},"climax":{"posr1":"This novel is a short and crisp masterpiece written by Paulo Coelho. It's a story about an Andalusian shepherd who travel seeking a treasure, after having a recurring dream about it. The last few pages hold a good climax for this short novel. It's the best novel i have read until now.","posr2":"\"The Alchemist' - a story revolving around a youth named Santiago, a boy living in illusions, seeking materialistic things and quite far away from his destiny is adviced by \"The Alchemist\" and Omens on a dangerous journey throughtout north africa, a story , weel knit, full of philosophical things and a good climax :D","positive":2},"masterpiece":{"posr1":"It's just a brilliant and marvelous masterpiece by any author. I read and re-read and re-read. Every time I read I learn new things. Its superb. Book lovers must have it in your shelf.","negr1":"This novel is a short and crisp masterpiece written by Paulo Coelho. It's a story about an Andalusian shepherd who travel seeking a treasure, after having a recurring dream about it. The last few pages hold a good climax for this short novel. It's the best novel i have read until now.","negative":1,"positive":1}}