{"body":{"negr1":"Better buy a tata indicom walky than a samsung galaxy phone...... For god's sake....even an s4 comes with a cheap plastic body! 40K device witha 4Rs plastic body ...better they get back to making what they are really good at....-- washing machines","negative":1},"processor":{"posr1":"i buy this cell for my wife from flipkart cell have awsome perfomace strong battery exellent touch pad 4.7 inch size also good processor and inbuilt memory very good 4.1 jelly bean in 15 range thats phone is awsome","negr1":"very poor performance, many times it restart automatic. badly hang and slow processor perform. DONT LIKE THIS PRODUCT.","posr2":"in this price range.. it is item par excellence with its better processor;other features are as good as any one.if looking for performance,this is the one. though too many aaps will make anything hang","negr2":"i have purchased this phone last week.its processor is fast and giving good performance.camera as 5 MP,it is nice but not gr8. but those who want to do calls more frequent it is better for them.hang problem is not there.overall nice phone","negative":2,"positive":5},"games":{"posr1":"Main Draw back is tat it does nt support 1080p videos n sme high end graphic games, rest G Q is awesme phn fo 15k!!","negr1":"its now over a month using this phone . i was all the time doing multitasking playing heavy games and side by side using wats app nd fb . functioning is excellent problems :- low sund quality doent support hd videos camera quality is good but zoom is not clear","negr2":"pros: performing qualcomm Quad core processor nice ergonomics bigger screen at budget dual sim nice gaming performance cons: screen resolution is okayish (720P at this screen size is must for wow factor) LCDscreen , Super AMOLED is much better may be more internal memory would helped in keeping oversized games at one place. Average battery life","negative":2,"positive":1},"screen":{"posr1":"Summary Display-great-4/5 Processor- great-4/5 Touch Response- Great-4/5 Music Speaker sound- Mediocre-2.5/5 In Ear Headphone sound- 3/5 Gaming Graphics-3.5/5 Build quality-3/5 On average i give it a 4 star A very good handset for those who are upgrading to large screens. This is the perfect size screen and can be held in one hand.","negr1":"Samsung I8552 is has made for high usage having comfortable screen size. UI is great and goes well with the games. Speed, use, handling etc all are good, overall very good phone and I am satisfied with it. service ( shopping & delivery) provided by flipkart was awesome","posr2":"I am using this phone for 4 months and it is the best experience ever.The phone has never hanged........the apps work very smooth ,the screen is very bright and clear,excellent camera and clear photos.this is the best phone in this cost range... Hats off to flipkart for providing such a good price and delivering it within a day.... KEEP IT UP flipkart....","negr2":"Very Good service by Flip-kart, Come to product its totally disappointed , While playing a video i was getting a line on screen but not with normal screen, but only playing video i found it ... so not satisfied with product","negative":3,"positive":7},"RAM":{"posr1":"The hone is exceptionally good and performs at par with the Top end smartphone options available, only the RAM could have been better remaining aspects are fantastic, i am really happy with the investment made and it is value for money spent.","posr2":"this phone is really really worth the price..more than you expect..all sub-standard brands are not upto the mark in this price range..awesome scree, processor and RAM are enough, camera is too good and display is quite outstanding..definitely buy this one over any other in this budget..","positive":2},"Camera":{"posr1":"Its a nice phone. screen size is good only drawback is it hangs always. Nice look and the Camera is also good.","posr2":"I had bought this phone in last week from samsung outlet in 15.2K including flip cover and screen guard. Not seen any problem yet. Camera is good... Not hanged after installing 4-5 games. Touch is awesome. Processor is very good. Size is comfortable to carry phone in pockets. Battery gets discharged fast while using 2g. I would recommend to buy this phone if your budget is around 15K.","positive":3},"cell":{"posr1":"very good cell, good battery , quick response and nice display HD display would be going great if provided overall nice choice","posr2":"It is really a very good cell phone. I am very happy using this phone It is value for money buy. fast processor, user friendly. feature rich. good design,","positive":2},"SIM":{"posr1":"Simply awesome mobile,best performance,No lagging anywhere,even i played Real Racing 3,it was run very smooth,nice look,totaly no loss,guys go for it,better than Grand......but its a dual SIM with micro SIM slots,otherwise i would give full points....:(...but still im happy .....:)","positive":1},"display":{"posr1":"This one is a decent phone for the price, it got in under some offer for pretty cheap and I must say it is worth every penny, I just wish it had a good display, the colors are all washed out on this one compared to the original grand.","posr2":"Same design trend follows. Much cheaper hardware. Phone service must be bad as customer care people will continue to say its a' trial ' series phone. no decent display. overall Samsung has lost its bite in this segment.","positive":6},"size":{"posr1":"Its a nice phone. screen size is good only drawback is it hangs always. Nice look and the Camera is also good.","negr1":"I love the size of this mobile since I feel 5 inch grand duos has uncomfortable size. If lime pie update is announced for this handset sure this will be a smashing hit. I will buy this after reading the review from gsmarena.","posr2":"I really like this phone. It has a good screen size not too big not too small. Easy to carry around and Ideal for viewing videos (picture quality is really crisp). Touch screen response is very good. Almost as good as iPhone (doesn't beat iPhone response though). Excellent sound quality. Definitely value for money for the price.","negative":1,"positive":5},"price":{"posr1":"I have ordered this phone from flip cart & i got the better price But i hve not satisfied with the packing just a bubble sheet on the mobile box i had high expectation, But product is good and delivery in time. The phone is really mind blowing > Batter backup 2days good >speed is good >Display is good Value for money standard charted bank provide me 15% cash back that's great & cool","negr1":"Quattro is the best phone in the affrodable price range. this the the best phone in low price of android (SAMSUNG) i would like to recomend this to those guys who are looking for a Handy , smart and powerful phone, means POWER PACK......","posr2":"I am using this phone for 4 months and it is the best experience ever.The phone has never hanged........the apps work very smooth ,the screen is very bright and clear,excellent camera and clear photos.this is the best phone in this cost range... Hats off to flipkart for providing such a good price and delivering it within a day.... KEEP IT UP flipkart....","negr2":"frist of all the product is fully loaded. and this product gives better fight to galaxy grand. with low price. touch is quite good and better to handle in hand. its 1 gb ram gives no hang effect on mobile.","negative":4,"positive":5},"playback":{"posr1":"friends i was confused to buy wheather galaxy quattro or sony xperia l.... 1) i ll use 24hours torrent download through wifi 2) i need 720p video playback with excellent hd clarity 3) i need excellent music playback clarity 4) best camera clarity 5) long battery backup 6) swype message typing 7) video calling through skype....","positive":1},"touch":{"posr1":"the phone for which i was luking good camera good processor good touch good battery life a good speaker quality too","posr2":"frist of all the product is fully loaded. and this product gives better fight to galaxy grand. with low price. touch is quite good and better to handle in hand. its 1 gb ram gives no hang effect on mobile.","positive":5},"quality":{"posr1":"its now over a month using this phone . i was all the time doing multitasking playing heavy games and side by side using wats app nd fb . functioning is excellent problems :- low sund quality doent support hd videos camera quality is good but zoom is not clear","posr2":"Screen resolution is bit down but it is value for money it's worth of buy the processor is Snapdragon A6 1.5 ghz 5mp camera is a good quality but alternate option is go for micromax canvas hd","positive":8},"resolution":{"posr1":"i am using this phone from last one week...battery drains soon(not preferred for heavy users/travellers)and screen resolution is not that good...remaining features like processing speed..etc are good.................................................................................................","negr1":"Micromax has poor customer support once u buy nxt tym it does not wrk its nt even wrth going in the dustbin. Samsung has a brand name and giving good competition to micromax cheap phones.. Samsung quattro is best with the budget whereas micromaxx canvas 3 has poor resolution wasted money phone","posr2":"If you are looking for a big screen phone with a good resolution, this phone is a good choice. Only con is that it runs a older version of Android","negative":1,"positive":3},"life":{"posr1":"i purchased this phone 10 days ago and the phone run smoothly but this mobile not supported hd video even 720p which is main problem battery life is good and the game subway surfers not run smoothly overall phone is good","posr2":"Very much satisfied with the phone. The battery life is good. A good brand to use. I recommend people to use this phone.","positive":4},"performance":{"posr1":"I'm still using this since I bought 6 months back. Normally I'm not satisfied with mabiles and keep changing. This one is very handy (not bulky) , performance is good, touch is excellent. May be it's android issue that if you swtich on wifi, it kills battery as well memory..overall a good phone","negr1":"very poor performance, many times it restart automatic. badly hang and slow processor perform. DONT LIKE THIS PRODUCT.","posr2":"its really awesome , best midranged android phone with all great features in it...u will just love it :) gaming camera everthing works great :) :) :) its performance is really awesome...i have used it for a week ,,,,i m just loving the way it works....you get some other cool featured phone by some other brands....but samsung has the best brand name :)","negative":1,"positive":8},"battery":{"posr1":"its a good product...fulfilled my requirements...good battery backup and attractive features... delivery is also perfect......","posr2":"very good cell, good battery , quick response and nice display HD display would be going great if provided overall nice choice","positive":2},"cam":{"posr1":"Phone overall very good........... draw back is front cam.. very poor front cam.............. and no hd video... for this cost at least company has to give 1.3mp cam for front and hd video recording for back cam.... other than this mobile is superb.","negr1":"I ordered Grand Quattro cause,I like 1.2 Quad core with 5 Mp cam i need,As i am photographer i like result of cam too good.Phone battery last a good.Also performance is very smooth till date. Flipart,Given responce timely good and very good fast delivery in time i need.","negative":1,"positive":1},"Processor":{"posr1":"I had bought this phone in last week from samsung outlet in 15.2K including flip cover and screen guard. Not seen any problem yet. Camera is good... Not hanged after installing 4-5 games. Touch is awesome. Processor is very good. Size is comfortable to carry phone in pockets. Battery gets discharged fast while using 2g. I would recommend to buy this phone if your budget is around 15K.","positive":1},"backup":{"posr1":"Please buy this mobile. Its performance is really awesome... All aspects it is a good mobile. Specs are really good. Battery backup is good. AMOLED screen is not available. May be samsung can consider this and in future can come up with good decision.","posr2":"Samsung I8552 - Galaxy Grand Quattro is good fone , battery backup is also good and all types of games you can play, all over its good fone in range of 16k, only improvement need to make faster . flippcart service is also very fast they will say withing 4 working days but it i recieved second day itself.","positive":3},"speed":{"posr1":"Using this product from last 5 months.. but not happy with the speed I think they can manage the resources very well and the speed can be increased. Very happy to take it from Flipkart very nice service..... Little bit unsatisfied I thought I should have brought Nexus 4 .. speed is awesome... if you have the budget then you can go for Nexus 4 else take Samsung Quattro...","negr1":"Very nice phone, styling features.. speed is little slow RAM is showing 845 only and I think if you wanna that mobile than please increase you budget and go with any 2 GB RAM mobile.","posr2":"One of the good phones in the medium range, worth its price. Decent camera and good processor speed. A good phone by Samsung for people who need a dual sim android phone.","negative":1,"positive":5},"camera":{"posr1":"i purchased the phone for 16500. im fully satisfied with the phone. pros+ 1.2ghz&1gbram 4.7 screen ppi..199 internal 8gb better looks better camera in daylight dual sim external memory 32gb cons- nighttime camera 1day battery totally the best phone in its class....","negr1":"As usual nice product in budget range by Samsung. Screen size is good, I am not happy with screen resolution I never like quality of picture on mobile phone as compare to actual camera.","posr2":"this is a good option for a buyer who want to buy a phone having phablet experience in Budget!!!! also u will feel like handling phones like Galaxy S3,Galaxy Grand and other high range phones of the Samsung...camera is good and speed of phone is also better than grand duos bcoz of Quad Core Processor......Best phone in its segment...","negative":1,"positive":8},"front":{"negr1":"Phone overall very good........... draw back is front cam.. very poor front cam.............. and no hd video... for this cost at least company has to give 1.3mp cam for front and hd video recording for back cam.... other than this mobile is superb.","negative":1},"memory":{"posr1":"good piece at awesome price.. good quad processor , internal memory is also good.. playing games is very njoyable","posr2":"Very good Android phone with Jelly bean installed in it. Works fine and has a big advantage of having 5Gb usable internal memory. first they have send me damaged phone but, after complaint they give me full brand new box giving to me... very fast service ... Regards, Nikhil","positive":4},"photos":{"posr1":"Excellent quality.User friendly features.Good quality photos and videos.Text alert for battery charging is interesting.","negr1":"I have replaced my Galaxy Y for an exchange offer of Rs.3000/- less to buy this phone. Speed of the phone is not up to the mark. Very sluggish while browsing 3G internet. Night photos are very poor. It is not worth to spend more than 15K money for this.","negative":1,"positive":1},"sim":{"posr1":"I think this peice has some deffect .. its getting shutting down with out doing any thing . If i just place it on desk or in pocket . its just switching off. Once when i used dual sim it restarted whatever application i opened. it happened until i removed the second sim from mobile. I raised a Incident 130709-015371 they gave some trouble shotting tips but i could not able to perform as they said","negr1":"I am posting my comments after using quattro for 4 months - Phone works fine with single sim and the moment you insert sim into the second slot the phone becomes unstable. phone restarts automatically and starts taking time to load apps and games and the gaming experience is also pathetic. My recommendation would be to buy a windows phone instead of wasting money in android or Samsung.","posr2":"One of the good phones in the medium range, worth its price. Decent camera and good processor speed. A good phone by Samsung for people who need a dual sim android phone.","negative":1,"positive":3},"smartphone":{"posr1":"I purchased the phone online and it makes me happy to say that it is not bad... a good smartphone which has its own value.... no need to write 200 characters... why should I? I have to write only the thing which I felt","posr2":"My Galaxy Grand Quattro is an awesome smartphone with smart features. No complaint , Value for money . Super duper easy to carry in pocket than 5.5 inches mobiles and many more","positive":4}}