{"processing":{"posr1":"Awesome phone....good processing speeed,sufficient RAM. Only disadvantage is No LED Flash... It has Smart Dual Active Sim Facility. good battery backup Good quality of system sound a very large display 3.5 inch makes easy to surf the internet","positive":1},"os":{"posr1":"pros: -->3.5\" screen -->5MP camera -->2GB internal memory --> good battery backup with 1300 mah cons: -->android 2.3 older os there is no upgradation to newer versions --> RAM memory available 320MB only i got this only for 5779/- so its satisfied worth of it.","positive":1},"screen":{"posr1":"Display (262k), battery (1300 mah) are average but not bad. Lack of secondary camera & flash is a minus though. But screen is quite big & it has virtually all other features. Also this phone was wrongly mentioned as dual active initially and hence many reviews (including in many other sites) quoted so. Now it seems to be clarified as dual standby only.","positive":1},"price":{"posr1":"I am happy to say that I got this Mobile in good condition, and at the best price. This was the lowest price I found by comparing all other site. Flipkart is doing nice job and I like to Shop more from Flipkart","posr2":"It is very good android phone for reasonable price. The screen size is good for general reading as well email/gtalk inputs. Initial screen display after power on is delayed by 2 seconds or so, otherwise this is very good phone and I would highly recommend to android lovers.","positive":5},"quality":{"negr1":"I'm using this mobile for last one year. Very very very slow phone, Poor battery backup, Camera better than average, Panel quality is very poor. Only my happy is still not went to service center (But I used this mobile very rarely) .","negr2":"Awesome phone....good processing speeed,sufficient RAM. Only disadvantage is No LED Flash... It has Smart Dual Active Sim Facility. good battery backup Good quality of system sound a very large display 3.5 inch makes easy to surf the internet","negative":3},"running":{"posr1":"THIS PRODUCT IS VERY GOOD FACILITY & CONDITION To assure the smooth running of apps, the device comes","positive":1},"headphone":{"negr1":"this mobile is very poor quality.Their is many problems 1)Hanging problem 2)Very slow 3)performance low 4)headphone is damage withtin 4 months 1)Hanging problem 2)Very slow 3)performance low 4)headphone is damage withtin 4 months","negative":1},"life":{"posr1":"samsung don't know what ppl want.!!!!! i hv seen and used sooo many samsung phones, and view on samsong is It do give cheap phones.....but hv poor quality.....its software is not at all strong i.e phone life last for 1.5 year....thts all i can say for you guys.","posr2":"I bought this piece 3 months back from Flipkart . Its features are really great and I love this very much . It have a great battery life. But the only problem in this is Android 2.3 I will suggest u don't buy white colour mobile as it gets sppoiled after few days use. Go for Black","positive":2},"facility":{"posr1":"No secondary camera No flash No andrino Gpu only dual active facility might be useful battery 1300 mah may be handy only Not so impressive product from samsung if you want single sim mobile go for sony erricson","positive":1},"performance":{"negr1":"I bought this phone along with Sony Experia E (gifts for my dad and mom). Since both of them were of similar price, I expected both to have similar experience. The Galaxy ace duos is much laggier than the Experia. It also hangs a lot and the performance is slow. Screen resolution leaves much to be desired. Well, I guess that's what you get for the price.","negr2":"this mobile is very poor quality.Their is many problems 1)Hanging problem 2)Very slow 3)performance low 4)headphone is damage withtin 4 months 1)Hanging problem 2)Very slow 3)performance low 4)headphone is damage withtin 4 months","negative":2},"backup":{"posr1":"pros: -->3.5\" screen -->5MP camera -->2GB internal memory --> good battery backup with 1300 mah cons: -->android 2.3 older os there is no upgradation to newer versions --> RAM memory available 320MB only i got this only for 5779/- so its satisfied worth of it.","negr1":"I want to share some negative side for this mobile. 1.Very poor battery backup. 2.Dual sim functioning not properly working. (My two sim have full signal always.but sometimes i have got sim1 calls forwared to sim2.dont know why ) 3.Graphics also poor My Suggestion pl dont waste money","posr2":"I'm using this mobile for last one year. Very very very slow phone, Poor battery backup, Camera better than average, Panel quality is very poor. Only my happy is still not went to service center (But I used this mobile very rarely) .","negative":1,"positive":2},"camera":{"posr1":"-dual active. no call drops. -8-9 hours battery wen continously used with internet. -camera is good (i am a professional photographer). -fast processor. -easy to use. -worth its price. i purchased it in 12700/- 6 months back.","negr1":"This samsung phone is not reasonable in any conditions. (one exception is dual sim thats all). It does not have 1.LED flash light which is very much required. 2.Secondary camera(in this scenario secondary camera is needed) Price is too high as compared to Samsung Galaxy Ace S5830.","negr2":"Display (262k), battery (1300 mah) are average but not bad. Lack of secondary camera & flash is a minus though. But screen is quite big & it has virtually all other features. Also this phone was wrongly mentioned as dual active initially and hence many reviews (including in many other sites) quoted so. Now it seems to be clarified as dual standby only.","negative":3,"positive":1},"interface":{"posr1":"The features are good, user interface is good....but its is DAMN slow.....so frustrating.... i think it has serious problem with the processor speed...it takes atleast 2 -3 f seconds to respond on any clicks...","posr2":"I was quite skeptical while buying this phone. But guys this phone just rocks. The wifi connectivity is good. The GUI interface is very smooth without any lags. The camera and the Music player volume are excellent. And i got this phone for just Rs.6119 what else can you expect from a branded product at this price.","positive":2},"LED":{"negr1":"Does this phone has 3.8 inch screen no, does this phone has 1 ghz processer no, does this phone has LED flash no,so why people are buying this phone go for Karbonn A9 this phone is an best dual sim phone available in market.","negative":1},"memory":{"posr1":"Good and bought it for just Rs.6800 good for the price thanks flipkart Waiting for more offers like this phone has internal memory 2+gb, 5mp cam drawback is this phone has no flash but for the price i have paid this is more than enough... thanks flipkart","posr2":"nice phone with cheapest price only available in flipkart.. samsung ace duos.. 3gb internal memory 5MP camera stylish phone..","positive":6},"volume":{"posr1":"I was quite skeptical while buying this phone. But guys this phone just rocks. The wifi connectivity is good. The GUI interface is very smooth without any lags. The camera and the Music player volume are excellent. And i got this phone for just Rs.6119 what else can you expect from a branded product at this price.","posr2":"sound quality and volume need to be improved. music system is good with headset. but speaker volume is not enough and it is very bad in outdoors and travelling. other features are good. this model may be recommended if the speaker quality is compromized.","positive":2},"sim":{"posr1":"the hardware supports active dual sim but TRAI policy in india does not allow so it's blocked in the firmware. // in active dual sim there are two radios and both can run simultaneously (i mean gsm radio not fm radio)","negr1":"No secondary camera No flash No andrino Gpu only dual active facility might be useful battery 1300 mah may be handy only Not so impressive product from samsung if you want single sim mobile go for sony erricson","posr2":"Over all phone is good, but who are using dual sim with other handset might find it difficult to handle. ex. when you call someone it dose not give you optional sim that you can choose to make your call, you need to define first the sim call preference.","negative":1,"positive":3}}