{"chip":{"posr1":"Samsung just dumping the old stuff in our country...Please release phones with international standards like s4 and note with SNAPDRAGON 800 not with your old Exynos chip.","positive":1},"screen":{"posr1":"big screen, good battery life and speed is good. No problem while running game. HD movie plays very smoothly. Processor is not judged on company only. Its processor is good what i felt.","positive":1},"flash":{"posr1":"Agreed its highly priced but it is not bad at all, - Screen is perfect - Touch is great - No lag at all - Good Battery - Crisp photos - photos taken in dark room also come up great, thanks to the fantastic flash.","positive":1},"hardware":{"negr1":"Go home same sung, you are drunk... 18k for this less hardware featured mob.. Other companies mobile provide a lot better specifications in a much lower price....","negative":1},"game":{"posr1":"big screen, good battery life and speed is good. No problem while running game. HD movie plays very smoothly. Processor is not judged on company only. Its processor is good what i felt.","positive":1},"specifications":{"posr1":"Go home same sung, you are drunk... 18k for this less hardware featured mob.. Other companies mobile provide a lot better specifications in a much lower price....","positive":1},"Touch":{"posr1":"Agreed its highly priced but it is not bad at all, - Screen is perfect - Touch is great - No lag at all - Good Battery - Crisp photos - photos taken in dark room also come up great, thanks to the fantastic flash.","positive":1},"size":{"posr1":"Good Phone... with good processor, camera. Screen size is good. Multi Window feature is very well done.","positive":1},"cover":{"negr1":"bought the phone and enjoying it.Its a pretty good phone. I bought it from a local shop around 15,900 only with all flip cover and screen guard. Am loving the phone.","negative":1},"price":{"posr1":"This handset is highly overpriced. The correct price for this is no more than 12k. it might even sell at 13k. will sell like hot cake at 11k. but at 18+, anyone buying this set is has to be a die-hard samsung fan. I see no reason whatsoever to buy this set at 18399.","negr1":"samsung is launching a new model every week with the motive of extracting as much money as possible from Indian customers. instead of launching uncountable models in a year, they should launch a feature packed quality product with a realistic price. this new product grand neo not even comparable with moto g and xolo q1100 mobiles in terms of features. one can easily get better features than this grand neo in rs 14000.","negr2":"Go home same sung, you are drunk... 18k for this less hardware featured mob.. Other companies mobile provide a lot better specifications in a much lower price....","negative":3,"positive":1},"processor":{"posr1":"big screen, good battery life and speed is good. No problem while running game. HD movie plays very smoothly. Processor is not judged on company only. Its processor is good what i felt.","negr1":"Pathetic screen resolution, pathetic brodcom processor, pathetic boring design and cheap all plastic built. Not even a matt finish! Moto g priced at 12,499 runs over grand neo. Moto g destroys this stinky smelly grand neo who needs a deo.","negative":1,"positive":1},"expandable":{"posr1":"FEATURES GALAXY GRAND GALAXY GRAND NEO GALAXY GRAND 2 DISPLAY 5-inch WVGA 5-inch WVGA 5.25-inch HD PROCESSOR 1.2GHz dual-core 1.2GHz Cortex A7 quad-core 1.2GHz Snapdragon quad-core RAM 1GB 1GB 1.5GB CAMERAS (REAR/FRONT) 8-megapixel/1.9-megapixel 5-megapixel/0.3-megapixel 8-megapixel/1.9-megapixel STORAGE 8GB expandable 8GB expandable 8GB expandable BATTERY 2,100mAh 2,100mAh 2,600mAh ANDROID OS 4.2 Jelly Bean 4.2 Jelly Bean 4.3 Jelly Bean","positive":1}}